In [15]:
import pandas as pd
loans = pd.read_csv(
    "https://media.githubusercontent.com/media/onlyphantom/python4bankers/main/data_input/loan_new.csv",
    index_col='id',
    parse_dates=['issue_d']
)

# 1. make a copy of loans, save it as 'df'
# your code below ---
df = loans.copy()

# 2. find the number or rows and columns of 'df' using .shape
# your code below ---
print(df.shape)

(887379, 29)

In [16]:
df.columns

Index(['year', 'issue_d', 'final_d', 'emp_length_int', 'home_ownership',
       'home_ownership_cat', 'income_category', 'annual_inc', 'income_cat',
       'loan_amount', 'term', 'term_cat', 'application_type',
       'application_type_cat', 'purpose', 'purpose_cat', 'interest_payments',
       'interest_payment_cat', 'loan_condition', 'loan_condition_cat',
       'interest_rate', 'grade', 'grade_cat', 'dti', 'total_pymnt',
       'total_rec_prncp', 'recoveries', 'installment', 'region'],
      dtype='object')

In [17]:
# 3. use the .drop() method, and remove application_type_cat and final_d from 'df' 
# eg. .drop(['', ''], axis=__)
# your code below ---
df = df.drop(['application_type_cat', 'final_d'], axis=1)

# 4. use the .rename() method, rename 'dti' to 'debt_to_income' and 
# rename 'total_rec_prncp' to 'received_principle'
# eg. .rename(columns={'old_name': 'new_name'})
# your code below ---
df = df.rename(columns={
    "dti": "debt_to_income",
    "total_rec_prncp": "received_principle"
})

In [20]:
# 5. We're told that the first row is a misrecording. Rectify that by dropping the first row. 
# Verify that you've done this correctly by printing the number of rows of the resulting 'df'
# eg. .drop(100030405)
# your code below ---
df = df.drop(1077501)
print(df.shape)

(887378, 27)

In [21]:
print(loans.shape[0])

887379

In [23]:
df.head(3)

,year,issue_d,emp_length_int,home_ownership,home_ownership_cat,income_category,annual_inc,income_cat,loan_amount,term,...,loan_condition_cat,interest_rate,grade,grade_cat,debt_to_income,total_pymnt,received_principle,recoveries,installment,region
id,,,,,,,,,,,,,,,,,,,,,
1077430,2011,2011-01-12,0.5,RENT,1,Low,30000,1,2500,60 months,...,1,15.27,C,3,1.00,1008.710000,456.46,117.08,59.83,leinster
1077175,2011,2011-01-12,10.0,RENT,1,Low,12252,1,2400,36 months,...,0,15.96,C,3,8.72,3003.653644,2400.00,0.00,84.33,cannught
1076863,2011,2011-01-12,10.0,RENT,1,Low,49200,1,10000,36 months,...,0,13.49,C,3,20.00,12226.302210,10000.00,0.00,339.31,ulster

In [29]:
customers = {
    'name': ['NTUC Income', 'GIC'],
    'since': [pd.Timestamp('19970314'), pd.Timestamp('20030120')],
    'signatories': [3, 6],
    'industry': ['Financial', 'Sovereign'],
    'requireKYC': [True, False],
    'aum': [41.9, 488]
}

type(customers)

dict

In [39]:
x = pd.DataFrame(customers)
x

          name      since  signatories   industry  requireKYC    aum
0  NTUC Income 1997-03-14            3  Financial        True   41.9
1          GIC 2003-01-20            6  Sovereign       False  488.0

In [43]:
x.rename(columns={'name': 1}, inplace=True)
x

             1      since  signatories   industry  requireKYC    aum
0  NTUC Income 1997-03-14            3  Financial        True   41.9
1          GIC 2003-01-20            6  Sovereign       False  488.0

In [42]:
# using square bracket, x[start:end] where end is not inclusive
x[:3]

          name      since  signatories   industry  requireKYC    aum
0  NTUC Income 1997-03-14            3  Financial        True   41.9
1          GIC 2003-01-20            6  Sovereign       False  488.0

In [46]:
x[1]

0    NTUC Income
1            GIC
Name: 1, dtype: object

In [55]:
df.columns

Index(['year', 'issue_d', 'emp_length_int', 'home_ownership',
       'home_ownership_cat', 'income_category', 'annual_inc', 'income_cat',
       'loan_amount', 'term', 'term_cat', 'application_type', 'purpose',
       'purpose_cat', 'interest_payments', 'interest_payment_cat',
       'loan_condition', 'loan_condition_cat', 'interest_rate', 'grade',
       'grade_cat', 'debt_to_income', 'total_pymnt', 'received_principle',
       'recoveries', 'installment', 'region'],
      dtype='object')

In [59]:
df['emp_length_int'].describe()

count    887378.000000
mean          6.050560
std           3.507404
min           0.500000
25%           3.000000
50%           6.050000
75%          10.000000
max          10.000000
Name: emp_length_int, dtype: float64

In [56]:
df[['purpose', 'home_ownership', 'region']].head(7)

                    purpose home_ownership    region
id
1077430                 car           RENT  leinster
1077175      small_business           RENT  cannught
1076863               other           RENT    ulster
1075358               other           RENT    ulster
1075269             wedding           RENT   munster
1069639  debt_consolidation           RENT  leinster
1072053                 car           RENT    ulster

In [60]:
sel = ['purpose', 'home_ownership', 'region']
df[sel].head(3)

                purpose home_ownership    region
id
1077430             car           RENT  leinster
1077175  small_business           RENT  cannught
1076863           other           RENT    ulster

In [62]:
df.select_dtypes(exclude=['object']).head(3)

,year,issue_d,emp_length_int,home_ownership_cat,annual_inc,income_cat,loan_amount,term_cat,purpose_cat,interest_payment_cat,loan_condition_cat,interest_rate,grade_cat,debt_to_income,total_pymnt,received_principle,recoveries,installment
id,,,,,,,,,,,,,,,,,,
1077430,2011,2011-01-12,0.5,1,30000,1,2500,2,2,2,1,15.27,3,1.00,1008.710000,456.46,117.08,59.83
1077175,2011,2011-01-12,10.0,1,12252,1,2400,1,3,2,0,15.96,3,8.72,3003.653644,2400.00,0.00,84.33
1076863,2011,2011-01-12,10.0,1,49200,1,10000,1,4,2,0,13.49,3,20.00,12226.302210,10000.00,0.00,339.31

### Slicing and Indexing with Pandas

In [53]:
df.shape[0]

887378

When you use a square bracket (`[]`) to perform indexing or slicing, if you pass in a range (`[:5]` or `[8:10]`) this will considered slicing and performed on the row level. 

If you pass in a single value, it's going to be performed on the column level

To select a column:
- `x['debt_consolidated']` or `x[['debt_consolidated', 'bto', 'cpf_portion']]`

```
features = ['debt_consolidated', 'bto', 'cpf_portion']
data[features].head()
```

In [65]:
df['debt_to_income'].head()

id
1077430     1.00
1077175     8.72
1076863    20.00
1075358    17.94
1075269    11.20
Name: debt_to_income, dtype: float64